run/Tests/convAnalysis1D/medium/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-1   0   0)
    (1   0   0)
    (1 0.1   0)
    (-1 0.1   0)
    (-1   0   0.1)
    (1   0   0.1)
    (1 0.1   0.1)
    (-1 0.1   0.1)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (40 1 1) simpleGrading (1 1 1)
);

edges           
(
);

//boundary
patches         
(
    patch top
    (
        (4 5 6 7)
    )
    patch bottom
    (
        (0 3 2 1)
    )
    patch left
    (
        (0 4 7 3)
    )
    patch right
    (
        (2 6 5 1)
    )
    patch frontAndBack
    (
        (1 5 4 0)
        (3 7 6 2)
    )
);

// ************************************************************************* //
