run/Tests/convAnalysis1D/medium/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          40;
        startFace       39;
    }
    bottom
    {
        type            patch;
        nFaces          40;
        startFace       79;
    }
    left
    {
        type            patch;
        nFaces          1;
        startFace       119;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       120;
    }
    frontAndBack
    {
        type            patch;
        nFaces          80;
        startFace       121;
    }
)


// ************************************************************************* //
