run/Tests/convAnalysis1D/medium/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       preCellScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0 0);

boundaryField
{
    top
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    bottom
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    left
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    right
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    frontAndBack
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
}


// ************************************************************************* //
